# 导入matplotlib库
import matplotlib.pyplot as plt

# 配置宋体文字
plt.rcParams['font.sans-serif'] = ['Songti SC']

# 定义数据
x = [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022] # 年份
y1 = [140.60, 151.10, 165.60, 176.00, 172.00, 164.90, 177.00, 201.00, 238.00, 290.00, 341.00, 377.00, 457.00] # 报名人数（万）
y2 = [47.44, 49.46, 52.13, 54.09, 54.87, 57.06, 58.98, 72.22, 76.25, 81.13, 99.05, 105.07,110.35] # 录取人数（万）
y3 = [None, 4.25, 5.40, 3.75, -2.27, -4.13, 7.34, 13.56, 18.41, 21.85, 17.59, 6.08, 5.03] # 录取人数增长率
y4 = [33.75, 32.73, 31.49, 30.74, 31.90, 34.60, 33.33, 35.93, 32.02, 27.97, 29.04, 27.87, 24.15] # 录取率
y5 = [None, -3.02, -3.79, -2.38, 3.77, 8.46, -3.68, 7.81, -10.88, -12.64, 3.83, -4.05, -13.36] # 录取率增长率
y6 = [2.96, 3.06, 3.18, 3.25, 3.14, 2.89, 3, 2.78, 3.12, 3.57, 3.44, 3.59, 4.14] # 报录比（n:1，省略“:1”）

# 创建一个画布
plt.figure(dpi=600)

# 绘制折线图
plt.plot(x,y1,label="报名人数（万）")
plt.plot(x,y2,label="录取人数（万）")
plt.plot(x,y3,label="录取人数增长率（%）")
plt.plot(x,y4,label="录取率（%）")
plt.plot(x,y5,label="录取率增长率（%）")
plt.plot(x,y6,label="报录比（n:1，省略“:1”）")

# 设置x轴和y轴的标签
plt.xlabel("年份（年）")
plt.ylabel("数据")

# 设置标题
plt.title("高考数据分析")

# 设置图例
plt.legend()

# 显示图形
plt.show()
